[
    {
      "phases": "Forethought",
      "categories": [
        {
          "name": "F1. Goal Setting",
          "levels": [
            "LE provides goals predefined by the teacher, and do not allow students to set or modify their goals within LE, nor can they easily access goal related performance indicators.",
            "LE offers detailed insights into students' learning progress in relation to the course goals. However, it does not allow students to set or modify their own learning goals within the platform.",
            "LE offers a variety of learning goals for students to choose from (e.g. course mastery or passing). Students can also set custom goals related to content or performance. Also, LE provides detailed analysis related to the chosen goals."
          ]
        },
        {
          "name": "F2. Strategic Planning",
          "levels": [
            "LE facilitates the sharing and accessibility of learning resources but does not include tools to help students select learning paths, determine appropriate actions, or plan task execution.",
            "LE provides with an overview of all available learning resources (those completed, left unfinished, or which are next), allowing them to quickly access, prioritize tasks and identify the materials they need.",
            "LE provides students with an overview of all available learning resources, along with useful information such as success rates, progress tracking, and estimated time required for each resource. "
          ]
        },
        {
          "name": "F3. Self-Efficacy",
          "levels": [
            "LE provides minimal information, typically at midterm, about students' past performance, such as their success, progress, effort, or time spent. It does not actively promote the development of self-efficacy.",
            "LE offers detailed information about students' performance, progress, and effort, while also prompting them to reflect on their self-perceived efficacy and assess their capabilities.",
            "LE provides students with details about their efficacy or prompts them to reflect on their self-perceived efficacy. LE goes a step further by offering predictions (about success, outcomes, time needed, etc.) and help to set realistic expectations."
          ]
        },
        {
          "name": "F4. Task Value",
          "levels": [
            "LE provides assignments with no or limited practical application, connection to next learning chapters, or other subject or courses.",
            "LE allows students to apply their knowledge to solve realistic practice assignments (follows the principles of authenticity).",
            "LE provides advanced learning technologies that allows students to use professional tools, skills, or relevant methods (for their study or selected goal) to create or self-assess knowledge."
          ]
        },
        {
          "name": "F5. Goal Orientation",
          "levels": [
            "LE provides only general information regarding the course requirements (goal set by teacher). Students lack visibility into how they are performing or advancing towards their goals.",
            "LE offers students’ detailed criteria for success and displays their performance in relation to the goal (set by teacher). Students can compare progress and performance against the criteria and their goal.",
            "LE goes beyond providing information about students' progress, process, and outcome in relation to their goals. It also visualizes what and how needs to be improved or adjusted to attain the selected goal."
          ]
        }
      ]
    },
    {
      "phases": "Performance",
      "categories": [
        {
          "name": "P1. Self-Instruction",
          "levels": [
            "LE provides outline and table of learning content. Besides, there are general instructions about the course requirements to helps individuals take control of their learning.",
            "LE provides task-specific or general self-questions along learning resources to prompt students to achieve desired outcomes.",
            "LE provides adaptive cues that directed cognitive process and thinking during learning. A technology (like intelligent chatbot or similar) uses motivational technique to instruct steps in the coping process."
          ]
        },
        {
          "name": "P2. Imagery",
          "levels": [
            "LE uses images and visual representation of learning material to support the forming of vivid mental pictures and visual models.",
            "LE includes videos and tools for graphical strategies within the text (annotations, color-coded text, and similar visual aids are utilized to enhance knowledge organization).",
            "LE provides interactive simulations or virtual reality space for developing knowledge and practicing skills. LE could also support students in creating concept maps and visualizations."
          ]
        },
        {
          "name": "P3. Time Management",
          "levels": [
            "LE provides limited support for time management e.g., only mentioning deadlines and exam dates. LE do not record nor analyze time spent on learning.",
            "LE provides information about students’ past performance as well as the time spent on specific learning resources and overall learning. Deadlines reminders could be sent.",
            "LE provides information about students’ past behavior (or success, progress, time, etc.), but also offers future predictions on managing time effectively in relation to their selected goals."
          ]
        },
        {
          "name": "P4. Help Seeking",
          "levels": [
            "LE facilitates scheduled communication with the teacher. However, it lacks clear avenues or guidance for students to seek assistance when encountering challenges.",
            "LE offers a/synch channels for communication (forum, chat, LMS tools, etc.) which students can use to engage with peers and teachers, to ask questions, share concerns, or request support.",
            "LE instructs and supports students to use various communication channels (e.g., tasks shared with peers, collaborative joint activities). Additionally, help seeking support includes external resources, AI agents, or querying LLM."
          ]
        },
        {
          "name": "P5. Task Strategies",
          "levels": [
            "LE provides a general description of different strategies that can be used. There is no specific structure to support students in performing different tasks.",
            "LE offers task-related support strategies during learning activities (e.g. solving tasks, or self-assessing task solutions). Students are supported in redoing tasks using alternative strategies.",
            "LE offers task-specific strategies for different tasks (this can include tips on critical thinking, summarization, application of skills). Moreover, LE provide feedback on students’ learning strategies, behavior, and effective strategies etc."
          ]
        },
        {
          "name": "P6. Metacognitive Monitoring",
          "levels": [
            "LE do not specifically support analytics, monitoring understanding, and evaluating success of chosen learning strategies; aside from providing knowledge tests and tasks that require manually scoring results.",
            "LE supports students in monitoring their progress in relation to general course outcomes. Students can gauge their overall performance (or success, progress, etc.) against the formal objectives of the course (usually via learning dashboards).",
            "LE enables students to compare their progress globally, but also in relation to learning units, specific materials (e.g., texts, tasks, reflections), and individual items. Additionally, LE provides monitoring of SRL behavior, used strategies, and learning patterns."
          ]
        }
      ]
    },
    {
      "phases": "Self-reflection",
      "categories": [
        {
          "name": "S1. Self-Evaluation",
          "levels": [
            "LE provides a sample solution that may help students to self-evaluate their solution against master solution (feed-up). However, it does not support identification of areas for improvement.",
            "LE provides different types of tasks that allow students to evaluate their knowledge and skills through, for example, various assessments, self-assessments, or quizzes (feed-back).",
            "LE provides tasks for self-evaluation, but also offers additional data analysis, feedback and guidance on specific areas that need attention (feed-forward). LE marks and visualizes tasks that are underperformed in relation to the goal, recommending improvement."
          ]
        },
        {
          "name": "S2. Causal Attribution",
          "levels": [
            "LE offers a limited resources to reflect (e.g., knowledge tests and related rubrics). No questions specifically guide students how to evaluate factors of failure.",
            "LE encourages students to consider factors that influenced their failures. For example, self-assessment tasks involve rating solutions against different criteria or master solution.",
            "LE includes prompted critical reflection tasks after significant learning events or units. These tasks encourage reflection on strengths and weaknesses, performance, and progress toward achieving goals."
          ]
        },
        {
          "name": "S3. Self-Reactions",
          "levels": [
            "LE includes knowledge assessments with corresponding rubrics, but it does not consider experiences, emotions, or future goals.",
            "LE incorporates learning dashboard that provide insights (awareness and reflection) on their learning activities.",
            "LE provide a learning dashboard together with critical reflection tasks that specifically ask students to reflect on their learning experiences or think about their feelings of satisfaction or disappointment."
          ]
        },
        {
          "name": "S4. Adaptation",
          "levels": [
            "LE provides limited guidance or resources to assist students in modifying or adapting their approaches to learning. This is usually organized as scheduled virtual cohort meetings with teachers.",
            "LE provides information about learning progress and outcome. However, learning material do not adapt, and students cannot directly modify their learning goals within the LE.",
            "LE includes critical reflection tasks that specifically ask students to reflect on adjusting their learning strategies, setting new goal within LE, and to adapt their strategies (based on the information about learning progress)."
          ]
        }
      ]
    }
  ]